# WidthInPixels Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageType..::..WidthInPixels Property
ImageType Class See Also
---
Number of pixels in the horizontal direction of the image
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public int WidthInPixels { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WidthInPixels As Integer
	Get
```

Visual C++
---
```text
public:
property int WidthInPixels {
	int get ();
}
```

# See Also
ImageType Class
Autodesk.Revit.DB Namespace